jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KVxx_DFP.1.5.0.pdsc
        <!-- ******************************  MKV11Z128xxx7  ****************************** -->
        <device Dname="MKV11Z128xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="75000000"/>
          <compile header="Device\Include\MKV11Z7.h"  define="MKV11Z128xxx7"/>
          <debug svd="SVD\MKV11Z7.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFF000" size="0x4000"  init   ="0" default="1"/>
          <algorithm name="Flash\MKV_P128_2KB_SEC.FLM" start="0x00000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>

          <book name="Documents\KV11P64M75RM.pdf" title="MKV11Z128xxx7 Reference Manual"/>
          <book name="Documents\KV11P64M75.pdf"   title="MKV11Z128xxx7 Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KV3x  ****************************** -->
      <subFamily DsubFamily="KV3x">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
        <book name="Documents\dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <description>
The Kinetis KV3x family of MCUs is a high-performance solution for BLDC, PMSM and ACIM motor control applications.
Built upon the ARM Cortex-M4 core running at 100/120 MHz with DSP and floating point unit, it features dual 16-bit analog-to-digital converters (ADCs) sampling at up to 1.2 mega samples per second (MSPS), multiple motor control timers, 64 to 512 KB of flash memory and a comprehensive enablement suite from Freescale and its third-party resources including reference designs, software libraries and motor configuration tools.
        </description>

        <!-- ******************************  MKV30F64xxx10   ******************** -->
        <device Dname="MKV30F64xxx10">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
          <compile header="Device\Include\MKV30F12810.h"  define="MKV30F64xxx10"/>
          <debug svd="SVD\MKV30F12810.svd"/>
          <memory id="IROM1"                 start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory id="IRAM1"                 start="0x1FFFE000" size="0x4000"  init   ="0" default="1"/>
          <algorithm name="Flash\MK_P64.FLM" start="0x00000000" size="0x10000" RAMstart="0x20000000" RAMsize="0x0800" default="1"/>

          <book name="Documents\KV30P64M100SFARM.pdf" title="MKV30F64xxx10 Reference Manual"/>
          <book name="Documents\KV30P64M100SFA.pdf"   title="MKV30F64xxx10 Data Sheet"/>
        </device>

        <!-- ******************************  MKV30F128xxx10  ******************** -->
        <device Dname="MKV30F128xxx10">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
          <compile header="Device\Include\MKV30F12810.h"  define="MKV30F128xxx10"/>
          <debug svd="SVD\MKV30F12810.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x1FFFE000" size="0x4000"  init   ="0" default="1"/>
          <algorithm name="Flash\MK_P128.FLM" start="0x00000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x0800" default="1"/>

          <book name="Documents\KV30P64M100SFARM.pdf" title="MKV30F128xxx10 Reference Manual"/>
          <book name="Documents\KV30P64M100SFA.pdf"   title="MKV30F128xxx10 Data Sheet"/>
        </device>

        <!-- ******************************  MKV31F128xxx10 ********************* -->
        <device Dname="MKV31F128xxx10">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
          <compile header="Device\Include\MKV31F12810.h"  define="MKV31F128xxx10"/>
          <debug svd="SVD\MKV31F12810.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x1FFFE000" size="0x6000"  init   ="0" default="1"/>
          <algorithm name="Flash\MK_P128.FLM" start="0x00000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x0800" default="1"/>

          <book name="Documents\KV31P100M100SF9RM.pdf" title="MKV31F128xxx10 Reference Manual"/>
          <book name="Documents\KV31P100M100SF9.pdf"   title="MKV31F128xxx10 Data Sheet"/>
        </device>

        <!-- ******************************  MKV31F256xxx12 ********************* -->
        <device Dname="MKV31F256xxx12">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device\Include\MKV31F25612.h"  define="MKV31F256xxx12"/>
          <debug svd="SVD\MKV31F25612.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x1FFFC000" size="0xC000"  init   ="0" default="1"/>
          <algorithm name="Flash\MK_P256.FLM" start="0x00000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x0800" default="1"/>

          <book name="Documents\KV31P100M120SF8RM.pdf" title="MKV31F256xxx12 Reference Manual"/>
          <book name="Documents\KV31P100M120SF8.pdf"   title="MKV31F256xxx12 Data Sheet"/>
        </device>

        <!-- ******************************  MKV31F512xxx12 ********************* -->
        <device Dname="MKV31F512xxx12">
          <processor Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
          <compile header="Device\Include\MKV31F51212.h"  define="MKV31F512xxx12"/>
          <debug svd="SVD\MKV31F51212.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x80000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x1FFF8000" size="0x18000" init   ="0" default="1"/>
          <algorithm name="Flash\MK_P512.FLM" start="0x00000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x0800" default="1"/>

          <book name="Documents\KV31P100M120SF7RM.pdf" title="MKV31F512xxx12 Reference Manual"/>
          <book name="Documents\KV31P100M120SF7.pdf"   title="MKV31F512xxx12 Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KV4x  ****************************** -->
      <subFamily DsubFamily="KV4x">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
        <book name="Documents\dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <description>
The Kinetis KV4x family of MCUs is a high-performance solution for offering exceptional precision, sensing and control for the some of the most demanding applications in motor and power control.
Built upon the ARM Cortex-M4 core running at 168 MHz with DSP and floating point unit, it features dual 12-bit analog-to-digital converters (ADCs) with 240 ns conversion time, eFlexPWM module with 312ps resolution and NanoEdge support, up to 30 PWM channels for support of multi-motor systems and dual FlexCAN modules.
The Kinetis KV4x family is supported by a comprehensive enablement suite from Freescale and third-party resources including reference designs, software libraries and motor configuration tools.
        </description>

