jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KVxx_DFP.1.5.0.pdsc
        <!-- ******************************  MKV58F512xxx22  ******************** -->
        <device Dname="MKV58F512xxx22">
          <processor Dfpu="SP_FPU" Dmpu="0" Dendian="Little-endian" Dclock="220000000"/>
          <compile header="Device\Include\MKV58F22.h"  define="MKV58F512xxx22"/>
          <debug svd="SVD\MKV58F22.svd"/>
          <memory id="IROM1"                            start="0x10000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x20000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\MKV_P512_8KB_SEC.FLM"  start="0x10000000" size="0x00080000"             default="1"/>
        </device>

        <!-- ******************************  MKV58F1M0xxx22  ******************** -->
        <device Dname="MKV58F1M0xxx22">
          <processor Dfpu="SP_FPU" Dmpu="0" Dendian="Little-endian" Dclock="220000000"/>
          <compile header="Device\Include\MKV58F22.h"  define="MKV58F1M0xxx22"/>
          <debug svd="SVD\MKV58F22.svd"/>
          <memory id="IROM1"                            start="0x10000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <memory id="IRAM2"                            start="0x2F000000" size="0x00010000" init   ="0" default="1"/>
          <algorithm name="Flash\MKV_P1024_8KB_SEC.FLM" start="0x10000000" size="0x00080000"             default="1"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="KV10Z7 CMSIS">
      <description>Freescale Kinetis KV10 75MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV10Z16xxx7"/>
      <accept Dname="MKV10Z32xxx7"/>
    </condition>

    <condition id="MKV10Z1287 CMSIS">
      <description>Freescale Kinetis KV10 64/128 KB 75MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV10Z64xxx7"/>
      <accept Dname="MKV10Z128xxx7"/>
    </condition>

    <condition id="MKV11Z7 CMSIS">
      <description>Freescale Kinetis KV11 75MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV11Z64xxx7"/>
      <accept Dname="MKV11Z128xxx7"/>
    </condition>

    <condition id="KV30F10 CMSIS">
      <description>Freescale Kinetis KV30 100MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV30F128xxx10"/>
      <accept Dname="MKV30F64xxx10"/>
    </condition>

    <condition id="KV31F10 CMSIS">
      <description>Freescale Kinetis KV31 100MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV31F128xxx10"/>
    </condition>

    <condition id="KV31F25612 CMSIS">
      <description>Freescale Kinetis KV31 256 KB 120MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV31F256xxx12"/>
    </condition>

    <condition id="KV31F51212 CMSIS">
      <description>Freescale Kinetis KV31 512 KB 120MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV31F512xxx12"/>
    </condition>

    <condition id="KV42F16 CMSIS">
      <description>Freescale Kinetis KV42 168MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV42F64xxx16"/>
      <accept Dname="MKV42F128xxx16"/>
      <accept Dname="MKV42F256xxx16"/>
    </condition>

    <condition id="KV44F16 CMSIS">
      <description>Freescale Kinetis KV44 168MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV44F64xxx16"/>
      <accept Dname="MKV44F128xxx16"/>
      <accept Dname="MKV44F256xxx16"/>
    </condition>

    <condition id="KV46F16 CMSIS">
      <description>Freescale Kinetis KV46 168MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV46F128xxx16"/>
      <accept Dname="MKV46F256xxx16"/>
    </condition>

    <condition id="KV56F22 CMSIS">
      <description>Freescale Kinetis KV56 220MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV56F512xxx22"/>
      <accept Dname="MKV56F1M0xxx22"/>
    </condition>

    <condition id="KV58F22 CMSIS">
      <description>Freescale Kinetis KV58 220MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKV58F512xxx22"/>
      <accept Dname="MKV58F1M0xxx22"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup KV10Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="KV10Z7 CMSIS">
      <description>System Startup for Kinetis KV10 75MHz devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKV10Z7.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKV10Z7.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

